const a = `1.Сообщение записано с помощью алфавита, содержащего 8 символов, какое количество информации несет одна буква этого алфавита?
+1) 3 бита.
2) 2 бита
3) 1 бит
4) 4 бита
2.Информационный объем одного символа некоторого сообщения равен 6 битам. Сколько символов входит в алфавит, с помощью которого составлено это сообщение?
+1) 64 символа.
2) 63 символа
3) 60 символов
4) 65 символов
3.Информационный объем одного символа некоторого сообщения равен 5 битам. Каковы пределы (максимальное и минимальное значение) мощности алфавита, с помощью которого составлено это сообщение?
+1) 4 бита.
2) 2 бита
3) 6 бит
4) 8 бит
4.Сообщение, записанное буквами из 128-символьного алфавита, содержит 30 символов. Какой объем информации оно несет?
+1) 210 бит объем всего сообщения.
2) 220 бит объем всего сообщения.
3) 215 бит объем всего сообщения.
4) 240 бит объем всего сообщения.
5. Сообщение, составленное с помощью 32-символьного алфавита, содержит 80 символов. Другое сообщение составлено с использованием 64- символьного алфавита и содержит 70 символов. Сравните объемы информации, содержащейся в сообщениях.
+1) во втором сообщении информации больше, чем в первом.
2) в первом сообщении информации больше, чем во втором.
3) они равны.
4) алфавит содержит 512 символов.
6.Информационное сообщение объемом 4 Кбайта содержит 4096 символов, сколько символов содержит алфавит, при помощи которого было записано это сообщение?
+1) алфавит содержит 256 символов.
2) алфавит содержит 512 символов.
3) алфавит содержит 48 символов.
4) алфавит содержит 1024 символа.
7.Сколько килобайтов составляет сообщение из 512 символов 16 символьного алфавита?
+1) 0,25 Кбайт объем всего сообщения.
2) 16 Кбайт объем всего сообщения
3) 0,26 Кбайт объем всего сообщения
4) 25 Кбайт объем всего сообщения
8.Сколько символов содержит сообщение, записанное с помощью 256-символьного алфавита, если объем его составил 1/32 часть Мбайта?
+1) в сообщении 32768 символов.
2) в сообщении 32769 символов.
3) в сообщении 32770 символов.
4) в сообщении 32760 символов.
9.Объем сообщения, содержащего 2048 символов, составил 1/512 часть Мбайта. Каков размер алфавита, с помощью которого записано сообщение.
+1) размер алфавита равен 256 символов.
2) размер алфавита равен 250 символов
3) размер алфавита равен 512 символов
4) размер алфавита равен 1024 символа.
10.Для записи текста использовался 256-символьный алфавит. Каждая страница содержит 50 строк по 70 символов в строке. Какой объем информации содержат 5 страниц текста?
+1) объем всего текста 10,25 Кбайт.
2) объем всего текста 10,26 Кбайт
3) объем всего текста 9,25 Кбайт
4) объем всего текста 9,26 Кбайт
11.Сообщение занимает 3 страницы по 25 строк. В каждой строке записано по 60 символов. Сколько символов в использованном алфавите, если сообщение содержит 1125 байтов?
+1) в алфавите 4 символа
2) в алфавите 24 символа
3) в алфавите 2 символа
4) в алфавите 14 символов.
12.Для записи сообщения использовался 64-символьный алфавит. Каждая страница содержит по 30 строк. Все сообщение содержит 8775 байтов информации и занимает 6 страниц. Сколько символов в строке?
+1) в строке 65 символов.
2) в строке 60 символов
3) в строке 66 символов
4) в строке 67 символов.
13.Сообщение занимает 2 страницы и содержит 1/16 Кбайта информации. На каждой странице записано 256 символов. Какова мощность использованного
алфавита?
+1) в алфавите 2 символа.
2) в алфавите 4 символа
3) в алфавите 6 символов
4) в алфавите 10 символов.
14.Пользователь вводит текст с клавиатуры со скоростью 90 знаков в минуту. Какое количество информации будет содержать текст, который он набирал 15 минут (используется компьютерный алфавит)?
+1) текст содержит 1,3 Кбайта информации.
2) текст содержит 1,6 Кбайта информации
3) текст содержит 2 Кбайта информации
4) текст содержит 4 Кбайта информации.
15.Пользователь вводил текст с клавиатуры 10 минут. Какова его скорость ввода информации, если информационный объем полученного текста равен 1 Кбайт?
+1) скорость ввода текста 102 символа в минуту.
2) скорость ввода текста 103 символа в минуту
3) скорость ввода текста 104 символа в минуту
4) скорость ввода текста 108 символов в минуту.
16.Ученик 9 класса читает текст со скоростью 250 символов в минуту. При записи текста использовался алфавит, содержащий 64 символа. Какой объем информации получит ученик, если будет непрерывно читать 20 минут?
+1) ученик получил 3,7 Кбайт информации
2) ученик получил 3 Кбайта информации
3) ученик получил 3,6 Кбайт информации
4) ученик получил 2 Кбайта информации
17. Записать число 444 в римской системе счисления.
+1) CDXLIV
2) CLDXLIV
3) LCXXX
4) XXXLD
18.Записать число 1986 в римской системе счисления.
+1) MCMLXXXVI
2) MMLXXXVI
3) MCMLXXVI
4) MCMLXXXV
19.Процесс, при котором создаются условия, удовлетворяющие потребностям любого человека в получении необходимой информации это _______________.
ОТВЕТ: Информатизация общества.
_________
20._____________ - умение целенаправленно работать с информацией и использовать для ее получения, обработки и передачи компьютерную информационную технологию, современные технические средства и методы.
ОТВЕТ: Информационная культура
21. _____________ - отдельные документы и отдельные массивы документов, документы и массивы документов в информационных системах.
ОТВЕТ: Информационные ресурсы.
22. _______________ - получение одних информационных объектов из других путем выполнения некоторых действий.
ОТВЕТ: Обработка информации.
23.______________ - накопление информации на различных носителях.
ОТВЕТ: Хранение информации
24.Девочка заменила каждую букву своего имени ее номером в алфавите. Получилось 14-1- 26- 1. Как зовут девочку?
+1) Маша
2) Даша
3) Саша
4) Глаша.
25.С помощью 1 байта можно закодировать _____________ различных символов.
ОТВЕТ: 256
26.Вася действует по следующему алгоритму: Шаг 1. Пройти 10 м прямо. Шаг 2. Повернуть направо. Шаг 3. Повторять шаги 1-2, пока не будет пройдено 50 м. Шаг 4. Остановиться. После выполнения шага 4 расстояние до точки, из которой Вася начал свое движение, составит.
+1) 10 м
2) 60 м
3) 20 м
4) 50 м.
27. Минимальным элементом растрового изображения является…
+1) пиксель
2) растр
3) дюйм
4) ячейка
28.В результате опыта с подбрасыванием монеты получена информация объемом…
+1) 1 бит
2) 2 бита
3) 1,5 бита
4) 3 бита.
29.Рассматривается алфавит, состоящий из букв слова «ЗЕМЛЯНИКА». Из этого алфавита невозможно закодировать слово …
+1) КИНО
2) НЯЛЕ
3) ЗЕМЛЯ
4) МАМА.
30.Найдите решение уравнения 16 Кб = 32х бит.
1) 4
2) 2
3) 2048
+4) 3,4
5) 3,5.
31.Чему равен 1 Гбайт?
1) 103 Мбайт
+2) 210 Мбайт
3) 1000 Мбайт
4) 1000 000 Кбайт
5) 27 бит.
32.Сколько единиц в записи десятичного числа 95 в двоичной системе счисления?
1) 2
+2) 6
3) 3
4) 8
5) 1
33.На какую цифру заканчивается число в десятичной системе счисления, если в двоичной системе счисления оно имеет вид 11101001?
1) 2
2) 9
3) 4
+4) 3
5) 1.
34.Чему будет равно значение переменной a после выполнения цепочки операций присваивания: a:=2; b:=3; b:=b-a; c:=(a+b-1)*2; d:=c+a-b; a:=a*b*c+d;
1) 54
2) 7
3) 0
4) 18
+5) 13.
35.За основную единицу измерения количества информации принят….
1) 1 бод
+2) 1 бит
3) 1 байт
4) 1 Кбайт.
36.Как записывается десятичное число 5 в двоичной системе счисления?
+1) 101
2) 110
3) 111
4) 100.
37.Графический редактор предназначен для…
1) создания чертежей
+2) создания и редактирования рисунков
3) построения графиков
4) построения диаграмм.
38.Сколько бит в слове ИНФОРМАТИКА?
1) 11
+2) 88
3) 44
4) 1
39.Какое количество информации содержит один разряд шестнадцатеричного числа?
1) 1 бит
+2) 4 бита
3) 1 байт
4) 16 бит
40.Сколько бит информации необходимо для кодирования одной буквы?
1) 1
2) 2
+3) 8
4) 16
41.Сколько байт в словах ИНФОРМАЦИОННЫЕ ТЕХНОЛОГИИ?
+1) 24
2) 192
3) 25
4) 2
42.Растровый графический файл содержит черно-белое изображение с 16 градациями серого цвета размером 10 х. 10 точек. Каков информационный объем этого файла?
+1) 100 бит
2) 400 байт
3) 400 бит
4) 100 байт
43.Сколько бит в слове МЕГАБАЙТ?
1) 8
2) 32
+3) 64
4) 24
44.Сколько байт в 2 Гбайтах?
+1) 2 х. 230
2) 2 х. 23
3) 2 х. 220
4) 2 х. 231
45.Элементарная единица измерения информации, принимающая значение 1 или 0, это ….
+1) бит
2) бод
3) байт
4) Кбайт
46.Чему равен 1 Кбайт?
1) 1000 бит
2) 1000 байт
3) 1024 бит
+4) 1024 байт.
47.Каково будет значение переменной Х после выполнения операций присваивания:Х:=5; Х:=Х+1
1) 5
+2) 6
3) 1
4) 10.
48.Число в десятичной системе счисления имеет вид 9. В двоичной системе счисления это число записывается в виде ….
+1) 1001
2) 9
3) 11
4) 1000
49.Как записывается десятичное число 8 в двоичной системе счисления?
+1) 1000
2) 0000
3) 0100
4) 1111
50.Количество различных знаков или символов используемых для изображения цифр в данной системе называется….
+1) Основанием системы счисления
2) Позицией системы счисления
3) Системой счисления
4) Бесчисленным множеством позиционных систем
51.Способ записи чисел с помощью заданного набора специальных знаков (цифр) называется….
+1) Системой счисления
2) Позиционной системой счисления
3) Непозиционной системой счисления
4) Основанием позиционной системы счисления
52.В какой системе счисления вес цифры не зависит от ее позиции в записи числа?
+1) Непозиционной
2) Позиционной
3) Двоичной
4) Шестнадцатеричной
53.В какой системе счисления вес каждой цифры изменяется в зависимости от ее положения в последовательности цифр?
+1) Позиционной
2) Непозиционной
3) Двоичной
4) Шестнадцатеричной
54.Какие системы счисления относятся к позиционным?
+1) Двоичная, восьмеричная, десятичная, шестнадцатеричная
2) Римская, двоичная, восьмеричная
3) Шестнадцатеричная
4) Таких систем не существует
55.Дайте ответ в двоичной системе счисления: 111011+111001111=….
+1) 1000001010
2) 1111
3) A
4) 10
56.Дайте ответ в шестнадцатеричной системе счисления: ((A+0101)-0010*0101)*3=….
+1) F
2) 15
3) 1111
4) 0111
57.Перевести данное число в десятичную систему счисления: 10000012
+1) 65
2) 64
3) 67
4) 87
58.Перевести данное число из десятичной системы счисления в двоичную: 46410
+1) 111010000
2) 101010
3) 1111100
4) 1000001
59.Выполнить вычитание в двоичной системе счисления: 1101 - 11=….
+1) 1010
2) 1111
3) 1000
4) 0001
60.Выполнить умножение в двоичной системе счисления: 1011*111 =….
+1) 1001101
2) 10111
3) 11110
4) 001001
61.Найдите х из соотношения:16х байт = 256 Мбайт.
+1) х=7
2) х=6
3) х=8
4) х=10
5) х=11.
62.Укажите правильную последовательность происхождения информационных революций в истории человечества:
3 1) Третья революция произошла благодаря открытию электричества
1 2) Первая революция вызвана изобретением письменности
4 3) Четвертая революция связана с изобретением компьютера
2 4) Вторая революция вызвана изобретением книгопечатания.
5 5) Пятая революция связана с изобретением инновационных технологий.
63.Наука, которая изучает структуру и общие свойства информации, а также информационные процессы в живой и неживой природе, обществе и технике это __________________.
ОТВЕТ: информатика
64.________________ - общество, в котором большинство работающих занято производством, хранением, переработкой и реализацией информации, особенно высшей ее формы – знаний.
ОТВЕТ: Информационное общество.
65.Что такое информация с точки зрения вычислительной техники?
+1) сигналы
2) знания
3) сведения
4) данные.
66.Знания человека, которые он получает из окружающего мира и которые реализует с помощью вычислительной техники это __________________.
ОТВЕТ: Информация
67.Сигналы можно разделить на несколько типов…..
+1) по физической природе
2) по способу передачи информации
3) по способу хранения информации
+4) по способу восприятия
5) по способу обработки информации.
68.____________________ - среда для записи и хранения информации.
ОТВЕТ: Носитель информации.
69.Какое свойство информации зависит от человеческого фактора?
+1) Объективность
2) Полнота
3) Актуальность
4) Достоверность.
70._________________ - степень соответствия информации текущему моменту времени.
ОТВЕТ: Актуальность
71._________________ - система условных знаков для представления информации.
ОТВЕТ: Код
72.Операция преобразования символов или группы символов одного кода в символы или группы символов другого кода это - ___________________.
ОТВЕТ: Кодирование.
73.Сообщение несет больше информации, если в нем содержатся новые и понятные сведения. Такое сообщение называется __________________.
ОТВЕТ: Информативным.
74.__________________ - это количество информации, уменьшающее неопределенность знаний в два раза.
ОТВЕТ: 1 бит.
75.Какое количество информации будет получено при отгадывании числа из интервала от 1 до 11?
+1) I = 3,45943
2) I = 6,45943
3) I = 2,45943
4) I = 8,45943.
76.Какой объем информации содержит сообщение, уменьшающее неопределенность в 4 раза?
+1) 2 бита
2) 1 бит
3) 4 бита
4) 1 байт.
77.Была получена телеграмма: «Встречайте, вагон 7». Известно, что в составе поезда 16 вагонов. Какое количество информации было получено?
+1) 4 бита
2) 8 бит
3) 3 байта
4) 4 Кбайта.
78.Сообщение о том, что Петя живет во втором подъезде, несет 3 бита информации. Сколько подъездов в доме?
+1) 8 подъездов
2) 4 подъезда
3) 2 подъезда
4) 10 подъездов.
79.Загадано слово из 10 букв. Вы просите открыть пятую букву. Вам ее открыли. Сколько информации вы получили?
+1) 3,3 бит
2) 6,3 бит
3) 5,2 бит
4) 5,4 бит.
80.В корзине лежат 8 черных шаров и 24 белых. Сколько информации несет сообщение о том, что достали черный шар?
+1) 2 бита
2) 4 бита
3) 8 бит
4) 16 бит.
81.В коробке лежат 64 цветных карандаша. Сообщение о том, что достали
белый карандаш, несет 4 бита информации. Сколько белых карандашей было в корзине?
+1) 4
2) 2
3) 6
4) 8.
82.За четверть ученик получил 100 оценок. Сообщение о том, что он получил пятерку, несет 2 бита информации. Сколько пятерок ученик получил за четверть?
+1) 25
2) 20
3) 24
4) 30.
83.____________ - символы участвующие в записи числа и составляющие некоторый алфавит.
ОТВЕТ: Цифры.
84.____________ - это позиция цифры в числе.
ОТВЕТ: Разряд.
85.____________ - количество цифр или других знаков, используемых для записи чисел в данной системе счисления.
ОТВЕТ: Основание позиционной системы счисления
ОТВЕТ: Основание
ОТВЕТ: Основание системы счисления.
86.Сравните числа: 510 и 58.
1) 510 > 58
2) 510 < 58
+3) 510 = 58
4) 11112 > 11118
87.Сравните числа: 11112 и 11118.
+1) 11112 < 11118
2) 11112 = 11118
3) 11112 > 11118
4) нет верного ответа.
88.В классе 11112 девочек и 10102 мальчиков. Сколько учеников в классе?
+1) 25
2) 26
3) 24
4) 27.
89.__________________ - это место на диске (группа байтов), у которого есть
имя.
ОТВЕТ: Файл.
90.___________________ - особый способ организации информации на жестком диске компьютера.
ОТВЕТ: Файловая система.
91.___________________ - последовательность символов, позволяющая пользователю ориентироваться в файловой системе и идентифицировать фалы.
ОТВЕТ: Имя файла.
92.___________________ - последовательность символов, позволяющая компьютеру сопоставлять программное обеспечение содержимому файла .
ОТВЕТ: Тип файла.
93.__________________ - совокупность файлов по одной тематике.
ОТВЕТ: Каталог.
94. _________________ - это ячейка процессора, в которой хранится машинное слово
ОТВЕТ: Регистр
95. Какие сети объединяют различные города, области и небольшие страны.
1) Глобальные вычислительные сети
+2) Региональные вычислительные сети
3) Локальные вычислительные сети
4) Корпоративные вычислительные сети.
96.Какие сети объединяют компьютеры, как правило, одной организации, которые располагаются компактно в одном или нескольких зданиях.
1) Глобальные вычислительные сети
2) Региональные вычислительные сети
+3) Локальные вычислительные сети
4) Корпоративные вычислительные сети.
97.Число одновременно обрабатываемых процессором битов _________________.
ОТВЕТ: Разрядность процессора.
98._____________________ - это логическая схема соединения компьютеров каналами связи.
ОТВЕТ: Топология сети.
99._____________________ - это программа работающая под управлением Windows
ОТВЕТ: Приложение.
100._______________ - это наиболее распространенное и дешевое кабельное соединение, представляющее собой пару скрюченных проводов.
ОТВЕТ: Витая пара.
101.Для хранения в оперативной памяти символы преобразуются в …
1) графические образы
2) числовые коды в шестнадцатеричной форме
3) числовые коды в десятичной системе счисления
+4) числовые коды в двоичной системе счисления.
102.Процессор выполняет…
1) систематизацию данных
2) постоянное хранение данных и программ после их обработки
3) генерацию импульсов
+4) обработку всех видов информации.
103.Внешними запоминающими устройствами являются…
+1) жесткий диск
2) оперативная память (ОЗУ)
+3) стример
4) кэш-память.
104.Указанную на рисунке группу файлов можно выделить с помощью …
1)клавиши Alt и левой клавиши мыши
2)клавиши Alt и правой клавиши мыши
+3)клавиши Shift и левой клавиши мыши
4)клавиши Shift и правой клавиши мыши.
105.При задании типа выравнивания «по правому краю» в представленном на картинке документе MS Word изменения затронут
+1) весь абзац
2) выделенное слово
3) только текущую строку
4) изменений не произойдет.
106.Какой результат даст формула в ячейке С1?
1) 0
2) ЛОЖЬ
+3) 1
4) ИСТИНА.
107.Сколько различных чисел можно закодировать с помощью 10 бит?
1) 100
+2) 1024
3) 9
4) 10
5) 27.
108.Сколько единиц в записи десятичного числа 45 в двоичной системе счисления?
1) 2
+2) 4
3) 3
4) 8
5) 1.
109.На какую цифру заканчивается число в десятичной системе счисления, если в двоичной системе счисления оно имеет вид 11101?
1) 2
2) 3
3) 4
+4) 9
5) 1.
110.Полный путь к файлу test.txt в операционной системе Windows XP имеет вид “c:\a\b\d\e\test.txt”. На каком диске размещается файл test.txt?
1) a
2) b
+3) c:
4) d
5) e.
111.Чему равно значение в ячейке С3 электронной таблицы?
1) 3
2) 4
+3) 5
4) 8
5) 1.
112. 24. На основе чего строится любая диаграмма?
1) книги Excel
2) графического файла
3) текстового файла
+4) данных таблицы.
113.Что делает Excel, если в составленной формуле содержится ошибка?
1) возвращает 0 как значение ячейки
+2) выводит сообщение о типе ошибки как значение ячейки
3) исправляет ошибку в формуле
4) удаляет формулу с ошибкой.
114.За единицу измерения количества информации принят….
1) бод
2) бит
+3) байт
4) Кбайт.
115.Производительность работы компьютера (быстрота выполнения операций) зависит от…
1) размера экрана дисплея
+2) частоты процессора
3) напряжения питания
4) быстроты нажатия на клавиши.
116.Какое устройство может оказывать вредное воздействие на здоровье человека?
1) принтер
+2) монитор
3) системный блок
4) модем.
117.Файл – это …
1) единица измерения информации
2) программа в оперативной
3) памяти
4) текст, распечатанный на принтере
+5) программа или данные на диске
118.В электронных таблицах выделена группа ячеек А1:В3. Сколько ячеек входит в эту группу?
+1) 6
2) 5
3) 4
4) 3
119.Результатом вычислений в ячейке С1 будет:
1) 5
2) 10
+3) 15
4) 20.
120.Основным элементом базы данных является…
+1) поле
2) форма
3) таблица
4) запись.
121.Какую строку будет занимать запись Pentium после проведения сортировки по возрастанию в поле Опер. память?
1) 1
2) 2
+3) 3
4) 4
122.Каково будет значение переменной Х после выполнения операций присваивания: Х:=5, Х:=Х+1
1) 5
+2) 6
3) 1
4) 10.
123.В текстовом редакторе при задании параметров страницы устанавливаются…
1) гарнитура, размер, начертание
2) отступ, интервал
+3) поля, ориентация
4) стиль, шаблон.
124.Чтобы сохранить текстовый файл (документ) в определенном формате необходимо задать…
1) размер шрифта
+2) тип файла
3) параметры абзаца
4) размеры страницы.
125.В электронных таблицах нельзя удалить…
1) столбец
2) строку
+3) имя ячейки
4) содержимое ячейки.
126.Результатом вычислений в ячейке С1 будет:
1) 5
2) 10
+3) 15
4) 20.
127.Тип поля (числовой, текстовой и др.) в базе данных определяется…
1) названием поля
2) шириной поля
3) количеством строк
+4) типом данных.
128.Какую строку будет занимать запись Pentium II после проведения сортировки по возрастанию в поле Винчестер?
1) 1
2) 2
3) 3
+4) 4.
129.Задан полный путь к файлу C:\DOC\PROBA.TXT.Каково имя каталога, в котором находится файл PROBA.TXT?
+1) DOC
2) PROBA.TXT
3) С:\DOC\PROBA.TXT
4) TXT.
130.Каково будет значение переменной Х после выполнения операций присваивания:
Х:=5, В:=10, Х:=Х+В.
1) 5
2) 10
+3) 15
4) 20.
131.Минимальным объектом, используемым в растровом графическом редакторе, является…
+1) точка экрана (пиксель)
2) объект (прямоугольник, круг и т.д.)
3) палитра цветов
4) символ (знакоместо).
132.В электронных таблицах формула не может включать в себя…
+1) числа
2) имена ячеек
3) текст
4) знаки арифметических операций.
133.Результатом вычислений в ячейке С1 будет:
1) 50
2) 100
+3) 150
4) 200.
134.Сколько в предъявленной базе данных полей?
1) 4
+2) 3
3) 2
4) 1.
135.Какую строку будет занимать запись Pentium после проведения сортировки по возрастанию в поле Компьютер?
1) 4
+2) 3
3) 2
4) 1.
136.Задан полный путь к файлу C:\DOC\PROBA.TXT. Каково расширение файла, определяющее его тип?
1) C:\DOC\PROBA.TXT
2) DOC\PROBA.TXT
3) PROBA.TXT
+4) TXT.
137.Растровый графический редактор предназначен для…
1) создания чертежей
2) построения графиков
3) построения диаграмм
+4) создания и редактирования рисунков.
138.В электронных таблицах имя ячейки образуется…
1) из имени столбца
2) из имени строки
+3) из имени
4) произвольно.
139.Результатом вычислений в ячейке С1 будет:
1) 25
+2) 50
3) 75
4) 100.
140.Сколько в предъявленной базе данных текстовых полей?
1) 1
+2) 2
3) 3
4) 4.
141.Какие записи будут найдены после проведения поиска в текстовом поле Компьютер с условием “содержит DX”?
1) 2
2) 3
3) 1,4
+4) 2,3.
142.______________________- это совокупность всех программ и соответствующей документации, обеспечивающая использование ЭВМ в интересах каждого ее пользователя.
Ответ: Программное обеспечение
143.Запись и считывание информации в дисководах для гибких дисков осуществляется с помощью…
+1) магнитной головки
2) лазера
3) термоэлемента
4) сенсорного датчика.
144.Задан полный путь к файлу C:\DOC\PROBA.TXT. Каково полное имя файла?
+1) C:\DOC\PROBA.TXT
2) PROBA.TXT
3) DOC\PROBA.TXT
4) TXT.
145.В текстовом редакторе выполнение операции Копирование становится возможным после…
1) установки курсора в определенное положение
2) сохранения файла
3) распечатки файла
+4) выделения фрагмента текста.
146.Какие записи будут найдены после проведения поиска в текстовом поле Компьютер с условием “содержит Pentium”?
1) 1
+2) 1,4
3) 4
4) 2,3.
147.Готовые к выполнению программы имеют расширение
+1) com, .exe
2) txt
3) doc
4) xls.
148.Специальное место на диске, в котором хранятся имена файлов, сведения о размере файлов и т.д. называется….
+ 1) каталогом (верный ответ)
2) файлом
3) программой
4) информацией.
149.Растровый графический файл содержит черно-белое изображение (без градаций серого) размером 100*100 точек. Тогда информационный объем
этого файла равен _________ бит?
+1) 10000
2) 100
3) 1250
4) 1204.
150.Что называется алгоритмом?
+1)Последовательность действий, выполнение которой приводит к решению поставленной задачи
2) Система команд исполнителя.
3) Нумерованная последовательность строк.
4) Ненумерованная последовательность строк.
151.Какую информацию несет строка Primer.txt 15 Kb 25.01.01 10:30
+1) Файл имеет имя, размер, дату создания, время создания и содержит текст
2) Файл находится в папке Primer
3) В файле находится графическая информация
4) В файле находится числовая информация.
152.Какое устройство компьютера предназначено для хранения программ и данных
+1) Запоминающее устройство
2) Микропроцессор
3) Арифметически-логическое устройство
4) Устройство управления.
153.Самая главная часть компьютера - это...
+1) Микропроцессор
2) Запоминающее устройство
3) Устройство управления
4) Устройство ввода.
154. На материнской плате размещается ....
+1) Процессор
2) Блок питания
3) Принтер
4) Жесткий диск.
155.Назовите два основных класса компьютеров
+1) Цифровые и аналоговые
2) Двоичные и восьмеричные
3) Электрические и механические
4) Матричные и струйные.
156.Дайте ответ в двоичной системе счисления: ((F-B)+(A-1001))*0010=….
+1) 1010
2) 1111
3) A
4) 10.
157.Дайте ответ в шестнадцатеричной системе счисления: ((A+0101)-0010*0101)*3=…
+1) F
2) 15
3) 1111
4) 0111.
158.Модем - это…
+1) техническое устройство
2) почтовая программа
3) сетевой протокол
4) сервер Интернет.
159.В диалоговом окне Exsel сразу над рабочим полем располагается ...
+1) Строка формул
2) Панель - Рисование
3) Кнопка Мастер диаграмм
4) Ничего нет.
160.Программы, предназначенные для эксплуатации и технического обслуживания ПК, и выполняющие различные вспомогательные функции называются ...
+1) Системными
2) Обслуживающими
3) Вспомогательными
4) Прикладными.
161.Системные программы, обеспечивающие удобный и наглядный способ общения с компьютером - это ...
+1) Программы - оболочки
2) Операционные системы
3) Программы интерфейса
4) Обслуживающие программы.
162.Текстовые и графические редакторы, электронные таблицы, системы кправления базами данных относятся к ...
+1) Инструментальным программам
2) Специальным программам
3) Прикладным программам
4) Пользовательским программам.
163.Прикладные программы…
+1) Предназначены для решения прикладных задач какой-либо отрасли
2) Относятся к системным программам
3) Запускаются только из Windows Commander
4) Нет верного ответа.
164.Утилиты, программы-упаковщики, программы для сжатия информации относятся к категории ...
+1) Системные программы
2) Прикладные программы
3) Инструментальные программы
4) Обучающие программы.
165.Средство объединения цифровой и текстовой информации ПК со звуковыми и видеосигналами - это ...
+1) Мультимедиа
2) Модем
3) Сканер
4) База данных.
166.Комплекс программ, обеспечивающих управление работой всех аппаратных устройств и доступ пользователя к ним, - это...
+1) Операционная система
2) Сканер
3) Монитор
4) Дисплей.
167.Окно для создания нового слайда в программе Power Pount можно вызвать, активировав комбинацию клавиш ...
+1) Ctrl+M
2) Ctrl+V
3) Ctrl+F
4) Ctrl+K.
168.Фигурный текст в программе Power Point создается с помощью ...
+1) Команды Объект - Вставка - Microsoft WordArt
2) Команды Объект - Вставка - Фигурный текст
3) Команды Объект - Вставка - Объемный текст
4) Комбинации клавиш Ctrl+Ctrl.
169.Команда Формат-Направление текста позволяет ...
+1) Изменить направления текста в таблице или отдельной ячейке
2) Изменить положение текста в документе
3) Изменить направления текста во всем документе
4) Изменить направления текста в меню программы.
170. Какое наибольшее количество символов имеет расширение имени файла?
+1) 3
2) 4
3) 6
4) 2.
171.Указание расположения различных элементов на слайде называется ...
+1) Авторазметкой слайда
2) Разметкой слайда
3) Образцом слайда
4) Нет верного ответа.
172.Прежде чем поместить таблицу Word в слайд необходимо ...
+1) Скопировать ее в буфер обмена
2) Сохранить ее
3) Создать ее
4) Нет верного ответа.
173.Специальный визуальный или звуковой эффект, добавляемый в текст или объект - это ...
+1) Анимация
2) Аудиоклип
3) Видеоклип
4) Автофигура.
174.Для поиска и отбора данных, удовлетворяющих определенным условиям, создается ...
+1) Запрос
2) Отчет
3) Форма
4) Таблица.
175.__________________– это совокупность программ для обеспечения работы компьютера.
Ответ: Системное ПО
176.Просмотреть в форме только определенные записи позволяет ...
+1) Фильтрация
2) Сортировка
3) Отбор
4) Отчет.
177.Описание рядов данных, сопровождающее диаграмму, называется ...
+1) Легендой
2) Сноской
3) Нет верного ответа
4) Примечанием
178.Перевести 2048 бит в Кбайт:
+1) 0,25 Кбайт
2) 0,26 Кбайт
3) 1,25 Кбайт
4) 1,27 Кбайт.
179.Перевести 1350 байт в Кбайт:
+1) 1,3 Кбайт
2) 1,7 Кбайт
3) 2,3 Кбайт
4) 2,5 Кбайт.
180.Процесс редактирование документа включает следующие операции:
+1) Удаление, добавление, копирование, перемещение символов, слов и т. д.
2) Удаление и добавление таблиц
3) Перемещение слов и символов
4) Копирование и перемещение текста.
181.Принцип записи данных на гибкий магнитный диск заключается в ...
+1) Намагничивании поверхности диска
2) Просвечивании лазером поверхности диска
3) Ядерно-магнитном резонансе рабочего слоя диска
4) Прожигании рабочего слоя диска.
182.Перед первым использованием дискету необходимо ...
+1) Отформатировать
2) Купить
3) Почистить
4) Отредактировать.
183.Накопители на гибких и жестких магнитных дисках относятся к ...
+1) ВЗУ
2) ОЗУ
3) ПЗУ
4) СОЗУ.
184.Какое из высказываний верное?
+1) Формула в Exsel обязана начинаться со знака равенства
2) Exsel - программа создания баз данных
3) Бит - составляющая материнской платы
4) Монитор - устройство печати.
185.Каждая ячейка на листе в Exsel имеет ...
+1) Свой уникальный адрес
2) Дату заполнения
3) Примечание
4) Конечное число заполнений.
186.Сообщение # ЗНАЧ! означает, что ...
+1) В качестве аргумента вместо числа или даты стоит текст
2) В качестве аргумента взято число несоответствующего формата
3) В качестве аргумента взят нуль
4) Нет верного ответа.
187.Набор договоренностей, который определяет обмен данными между различными программами называется ...
+1) Протоколом
2) Браузером
3) Драйвером
4) Сканером.
188. Если указатель мыши принимает вид двусторонней черной стрелки при наведении его на объект, то можно ...
+1) Изменить размеры этого объекта
2) Перенести объект в другое место
3) Изменить цветовую гамму объекта
4) Скопировать объект.
189.Основные операции, проводимые с ячейками в таблицах Word:
+1) Добавление, удаление, объединение и разбиение
2) Объединение, копирование и разбиение
3) Добавление, копирование и удаление
4) Удаление, сохранение и объединение.
190.Установив курсор в правую нижнюю ячейку таблицы и нажав клавишу Tab можно ...
+1) Добавить строку в конец таблицы
2) Удалить строку в конце таблицы
3) Добавить строку в начало таблицы
4) Удалить строку в начале таблицы.
191.Клавиша Shift в Power Point применяется для ...
+1) Выделения нескольких объектов
2) Удаления нескольких объектов
3) Выделения объекта
4) Удаления объекта.
192.Верно высказывание:
+1) Информация в таблице Access не должна дублироваться
2) Access - программ электронных таблиц
3) Нет верного ответа
4) Access - графический редактор.
193. Перевести данное число в десятичную систему счисления: 1000001
+1) 65
2) 64
3) 67
4) 87
194. Перевести данное число из десятичной системы счисления в двоичную: 464
+1) 111010000
2) 101010
3) 1111100
4) 1000001.
195.Выполнить умножение в двоичной системе счисления: 1011*111 = ....
+1) 1001101
2) 10111
3) 11110
4) 001001.
196.Команда Вид-Образец-Образец слайдов используется для ...
+1) Оформления презентации в едином стиле
2) Оформления слайда определенным стилем
3) Нет верного ответа
4) Создания шаблона слайда.
197.Автоматическое устройство осуществило перекодировку информационного сообщения на русском языке, первоначально записанного в 16-битном коде Unicode, в 8-битную кодировку КОИ-8. При этом информационное сообщение уменьшилось на 480 бит. Какова длина сообщения в символах?
1) 30
+2) 60
3) 120
4) 480
198.Считая, что каждый символ кодируется одним байтом, определите, чему равен информационный объем следующего высказывания Рене Декарта: «Я мыслю, следовательно, существую».
1) 28 бит
+2) 272 бита
3) 32 кбайта
4) 34 бита
199.В кодировке Unicode на каждый символ отводится два байта. Определите информационный объем слова из двадцати четырех символов в этой кодировке.
+1) 384 бита
2) 192 бита
3) 256 бит
4) 48 бит
200.Световое табло состоит из лампочек. Каждая лампочка может находиться в одном из трех состояний («включено», «выключено» или «мигает»). Какое наименьшее количество лампочек должно находиться на табло, чтобы с его помощью можно было передать 18 различных сигналов?
1) 6
2) 5
+3) 3
4) 4
201.Метеорологическая станция ведет наблюдение за влажностью воздуха. Результатом одного измерения является целое число от 0 до 100 процентов, которое записывается при помощи минимально возможного количества бит. Станция сделала 80 измерений. Определите информационный объем результатов наблюдений.
1) 80 бит
+2) 70 байт
3) 80 байт
4) 560 байт
202.Сколько существует различных последовательностей из символов «плюс» и «минус», длиной ровно в пять символов?
1) 64
2) 50
+3) 32
4) 20
203.Шахматная доска состоит 8 столбцов и 8 строк. Какое минимальное количество бит потребуется для кодирования координат одного шахматного поля?
1) 4
2) 5
+3) 6
4) 7
204.Двое играют в «крестики-нолики» на поле 4 на 4 клетки. Какое количество информации получил второй игрок, узнав ход первого игрока?
1) 1 бит
2) 2 бита
+3) 4 бита
4) 16 бит
205.Объем сообщения – 7,5 Кбайт. Известно, что данное сообщение содержит 7680 символов. Какова мощность алфавита?
1) 77
+2) 256
3) 156`;
export default a;